üîÅ What Does Duplicate Data Mean in Data Cleaning?
Duplicate data refers to rows (or records) in your dataset that appear more than once, either completely identical or nearly identical (e.g., same name and email but different timestamps).

‚úÖ Example of Duplicate Data
ID	Name	Email	Age
1	Alice	alice@email.com	25
2	Bob	bob@email.com	30
3	Alice	alice@email.com	25
4	Charlie	charlie@email.com	35

üîç Here, row 1 and row 3 are duplicates ‚Äî they contain exact same values across all columns.

In [12]:
import pandas as pd

In [13]:
data = {"name":["a","b","c","d","a","c"],"eng":[1,3,4,5,1,3],"hindi":[19,4,5,5,19,4]}

In [14]:
df = pd.DataFrame(data)
df

  name  eng  hindi
0    a    1     19
1    b    3      4
2    c    4      5
3    d    5      5
4    a    1     19
5    c    3      4

0th row and 4th row have duplicata data

In [8]:
df["duplicated"]=df.duplicated()
df

  name  eng  hindi  duplicated
0    a    1     19       False
1    b    3      4       False
2    c    4      5       False
3    d    5      5       False
4    a    1     19        True
5    c    3      4       False

In [16]:
#how to remove them
df.drop_duplicates(inplace=True)

In [17]:
df

  name  eng  hindi
0    a    1     19
1    b    3      4
2    c    4      5
3    d    5      5
5    c    3      4

In [18]:
dataset=pd.read_csv("../loan.csv")
dataset.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [19]:
dataset.shape

(614, 13)

In [ ]:
dataset.drop_duplicates(inplace=True) #after removing duplicates you can check how many of them were removed as you can see shape is same means no duplicates
dataset.shape

(614, 13)